Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.SetAsCurrentRevision Method
Overload List
Name | Description
SetAsCurrentRevision(ReferenceModel.Revision)
 Sets the given revision as current revision.
SetAsCurrentRevision(Int32, Int32)
 Sets the given revision as current revision.
Top
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace